10/data/attachments/d9cfc9d5868647c9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_47580c54-8541-4191-83be-e518dcba4b04</nif:username>
            <nif:friendToBeAdded>Robin_edge_Friend_93607_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>